"""
Задача №4. Решение в группах Два различных натуральных числа n и m
называются дружественными, если сумма делителей
числа n (включая 1, но исключая само n) равна числу m и наоборот.
Например, 220 и 284 – дружественные числа.
По данному числу k выведите все пары дружественных чисел,
каждое из которых не превосходит k.
Программа получает на вход одно натуральное число k,
не превосходящее 105. Программа должна вывести
все пары дружественных чисел, каждое из которых не превосходит k.
Пары необходимо выводить по одной в строке, разделяя пробелами.
Каждая пара должна быть выведена только один раз
(перестановка чисел новую пару не дает).
Ввод: Вывод: 300 220 284
"""

n = 220
m = 284
k = 105
def sum_divisors(n):
    return sum([i for i in range(1, n - 1) if n % i == 0])










